{"title":"Release 0.4","type":"release","content":"<p>June 07, 2023</p>\n<p>We are happy to announce the availability of Paimon 0.4. This is the first release of the system inside the Apache Incubator and under the name Paimon. Releases up to 0.3 were under the name Flink Table Store, a sub-project of Flink where Paimon originates from.</p>\n<h2 id=\"what-is-paimon\">What is Paimon?</h2><p>Apache Paimon(incubating) is a streaming data lake platform that supports high-speed data ingestion, change data tracking and efficient real-time analytics.</p>\n<p>Paimon offers the following core capabilities:</p>\n<ul>\n<li><strong>Unified Batch &amp; Streaming</strong>: Paimon supports batch write and batch read, as well as streaming write changes and streaming read table changelogs.</li>\n<li><strong>Data Lake</strong>: As a data lake storage, Paimon has the following advantages: low cost, high reliability, and scalable metadata.</li>\n<li><strong>Merge Engines</strong>: Paimon supports rich Merge Engines. By default, the last entry of the primary key is reserved. You can also use the &quot;partial-update&quot; or &quot;aggregation&quot; engine.</li>\n<li><strong>Changelog producer</strong>: Paimon supports rich Changelog producers, such as &quot;lookup&quot; and &quot;full-compaction&quot;. The correct changelog can simplify the construction of a streaming pipeline.</li>\n<li><strong>Append Only Tables</strong>: Paimon supports Append Only tables, automatically compact small files, and provides orderly stream reading. You can use this to replace message queues.</li>\n</ul>\n<h2 id=\"release-04\">Release 0.4</h2><p>Paimon 0.4 includes many bug fixes and improvements that make the system more stable and robust.</p>\n<p>Download the release <a href=\"https://paimon.apache.org/docs/0.4/project/download/\" target=\"_blank\" title=\"null\" rel=\"noopener\">here</a>.</p>\n","toc":[{"depth":2,"text":"What is Paimon?","id":"what-is-paimon"},{"depth":2,"text":"Release 0.4","id":"release-04"}],"alias":"release-0.4","version":"0.4.0","weight":40}